---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SpotSlopeSlopeDirection
source: html/70c7de96-bfc4-9d58-c2a0-bc51c54027a4.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SpotSlopeSlopeDirection Property

"Slope Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId SpotSlopeSlopeDirection { get; }
```